#+TITLE: Emacs Handbook

*本人为学习使用Emacs而翻译此文档，勿作它用。*
*原文档链接为：http://ergoemacs.org/emacs/emacs.html*


*** 创建

- 输入表头，例如：“|编号|数量|单价|总额|”，然后按"tab"键就会创建一个表格。
  如果需要在header下创建分隔线，在header后按回车至下一行并输入分隔线：“|-”，然后按“tab”键。
  或者在header中按快捷键"C-c -"，会在下一行输入分隔线。

  | 编号 | 数量 | 单价 |  总额 |
  |------+------+------+-------|
  |    1 |    3 | 3.45 | 10.35 |
  |    2 |    5 | 4.34 |    10 |
  |    3 |    6 | 5.43 | 32.58 |
  |    4 |    3 | 4.86 | 14.58 |
#+TBLFM: $4=$2*$3::@3$4=$1*$2

- 按快捷键"C-c |"然后按提示输入行列数创建表格。默认是5x2即5列2行，且其中一行是header。
- 还可以直接将buffer上已有数据格式化成表格：
  + 如果是以逗号","分隔的CSV格式数据，先将内容选中，然后按"C-c |"将其转换成表格形式(需要自己添加分隔线)；
  + 如果数据之间是用空格分隔的，选中内容之后，按快捷键"C-u 1 C-c |"。

*** 常量与引用

常量的定义可以通过"org-table-formula-constants"来进行，这样定义的常量是全局的；如果要定义局部的常量，可以在org文件中添加诸如这样的行："#+CONSTANTS: pi=3.14 eps=2.4e-6"。

可以在当前表格引用其他表格的域，这需要其他表格被命名为某个名字，例如，为下面第一个表格添加命名"#+NAME: fruit_expense"。

  #+NAME: fruit_expense
  | 名称 | 单价 | 数量 | 花费 |
  |------+------+------+------|
  | 苹果 |  5.3 |    2 | 10.6 |
  | 桔子 |  3.2 |    4 | 12.8 |
  | 香蕉 |  4.3 |    3 | 12.9 |
  |------+------+------+------|
  | 合计 |      |      | 36.3 |
  #+TBLFM: $4=$2*$3
  #+TBLFM: @5$4=vsum(@2$4..@4$4)

  引用之前的fruit_expense表格中的合计价格：在本表格下方添加"#+TBLFM: @2$2=remote(fruit_expense, @5$4)"。
  | 支出项目 | 支出总额 |
  |----------+----------|
  | 食物     |     36.3 |
  | 通勤     |          |
  #+TBLFM: @2$2=remote(fruit_expense, @5$4)

